In [1]:
import pandas as pd
from pandas import DataFrame,Series
import numpy as np
from sklearn import datasets
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
udata = pd.read_csv('temp/Users Data- V2.csv')

C:\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2717: DtypeWarning: Columns (2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,31,33,35,36,37,38) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
udata.head()

,user_id,platform_id,r2,r3,r4,r5,r6,r7,new_money_0_days,new_money_1_days,...,current_tier_id,Tier till day 7,ip_country,country_name,region_name,city_name,Unnamed: 39,Unnamed: 40,Unnamed: 41,Unnamed: 42
0,1000982.0,1.0,1,0,0,0,0,0,0,0,...,2,2.0,US,United States,California,Daly City,NaN,NaN,NaN,NaN
1,10020919.0,9.0,0,0,0,0,0,0,0,0,...,2,2.0,BE,Belgium,(null),Gent,NaN,NaN,NaN,NaN
2,10024442.0,2.0,1,1,1,1,1,1,0,8.33808,...,2,2.0,US,United States,New Jersey,Asbury Park,NaN,NaN,NaN,NaN
3,1002743.0,1.0,1,1,1,1,1,1,3.3864,3.3864,...,2,2.0,US,United States,Oklahoma,Oklahoma City,NaN,NaN,NaN,NaN
4,10031183.0,3.0,0,0,0,0,0,0,0,0,...,1,1.0,US,United States,Connecticut,Shelton,NaN,NaN,NaN,NaN

In [4]:
udata.columns

Index(['user_id', 'platform_id', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7',
       'new_money_0_days', 'new_money_1_days', 'new_money_2_days',
       'new_money_3_days', 'new_money_4_days', 'new_money_5_days',
       'new_money_6_days', 'new_money_7_days', 'new_money_lifetime',
       'transactions_0_days', 'transactions_1_days', 'transactions_2_days',
       'transactions_3_days', 'transactions_4_days', 'transactions_5_days',
       'transactions_6_days', 'transactions_7_days', 'transactions_lifetime',
       'sn_type_id', 'installation_ts', 'language', 'current_level',
       'Level till day 7', 'current_progression', 'Progress till day 7',
       'current_tier_id', 'Tier till day 7', 'ip_country', 'country_name',
       'region_name', 'city_name', 'Unnamed: 39', 'Unnamed: 40', 'Unnamed: 41',
       'Unnamed: 42'],
      dtype='object')

In [5]:
udata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65535 entries, 0 to 65534
Data columns (total 43 columns):
user_id                  30000 non-null float64
platform_id              30000 non-null float64
r2                       30000 non-null object
r3                       30000 non-null object
r4                       30000 non-null object
r5                       30000 non-null object
r6                       30000 non-null object
r7                       30000 non-null object
new_money_0_days         30000 non-null object
new_money_1_days         30000 non-null object
new_money_2_days         30000 non-null object
new_money_3_days         30000 non-null object
new_money_4_days         30000 non-null object
new_money_5_days         30000 non-null object
new_money_6_days         30000 non-null object
new_money_7_days         30000 non-null object
new_money_lifetime       30000 non-null object
transactions_0_days      30000 non-null object
transactions_1_days      30000 non-null object
transactions_2_days      30000 non-null object
transactions_3_days      30000 non-null object
transactions_4_days      30000 non-null object
transactions_5_days      30000 non-null object
transactions_6_days      30000 non-null object
transactions_7_days      30000 non-null object
transactions_lifetime    30000 non-null object
sn_type_id               30000 non-null object
installation_ts          30000 non-null object
language                 30000 non-null object
current_level            30000 non-null object
Level till day 7         30000 non-null float64
current_progression      30000 non-null object
Progress till day 7      30000 non-null float64
current_tier_id          30000 non-null object
Tier till day 7          30000 non-null float64
ip_country               29999 non-null object
country_name             30000 non-null object
region_name              30000 non-null object
city_name                30000 non-null object
Unnamed: 39              0 non-null float64
Unnamed: 40              0 non-null float64
Unnamed: 41              0 non-null float64
Unnamed: 42              0 non-null float64
dtypes: float64(9), object(34)
memory usage: 21.5+ MB

In [6]:
import numbers 
udata['new_money_lifetime'] = udata['new_money_lifetime'].map(lambda x:float(x) if isinstance(x, numbers.Number) else 0) 
udata['transactions_lifetime'] = udata['transactions_lifetime'].map(lambda x:float(x) if isinstance(x, numbers.Number) else 0)

In [12]:
features = ['new_money_lifetime','transactions_lifetime','country_name']
features = ['new_money_lifetime','transactions_lifetime']

In [17]:
udata1 = udata[features]

In [18]:
udata1.describe()

       new_money_lifetime  transactions_lifetime
count             30000.0                30000.0
mean                  0.0                    0.0
std                   0.0                    0.0
min                   0.0                    0.0
25%                   0.0                    0.0
50%                   0.0                    0.0
75%                   0.0                    0.0
max                   0.0                    0.0

In [22]:
udata1 = udata1.fillna(0)

In [23]:
df = pd.get_dummies(udata1)

In [24]:
df.columns

Index(['new_money_lifetime', 'transactions_lifetime'], dtype='object')

In [25]:

import numpy as np
import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d import Axes3D


from sklearn.cluster import KMeans

np.random.seed(5)

est = KMeans(n_clusters=8)

est.fit(df)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
    n_clusters=8, n_init=10, n_jobs=1, precompute_distances='auto',
    random_state=None, tol=0.0001, verbose=0)